{"data":{"site":{"siteMetadata":{"title":"Dev Blog","author":"Dika-Dika"}},"markdownRemark":{"id":"9160af9c-c0aa-5802-ae76-5ed95ed1763a","html":"<h2>Apa itu headless CMS</h2>\n<p>Sederhananya headless content management system merupakan satu bagian dari cms yang mana dibangun dari dasar sebagai gudang konten namun bisa tetap dapat menggunakan konsep Restful untuk menampilkan data disemua tampilan antarmuka.\nKonsep “headless” diambil dari bagian kepala(front-end) dari sebuah web dan tidak mengambil sebagian dari “badan”(back-end)</p>\n<p>Kebanyakan secara CMS tradisional mengkombinasikan suatu konten dan layer presentasi dari website itu sendiri. Sedangkan untuk headless CMS hanya bagian konten dan halaman antar-muka administratif seperti layar muka pembuat konten, fasilisator dari alur kerja sebuah konten dan cara mengkolaborasikannya, dan memastikan juga konten yang terorganisir dalam sebuah taksonomi yang terstruktur. </p>\n<p>Secara umum headless CMS diciptakan untuk kebutuhan sebuah era digital yang lebih ringkas dimana memfokuskan kepada personalisasi penggunanya. Berbeda dengan CMS seperti wordpress, drupal dan joomla, kebanyakan konten manajemen tersebut perlu pengaturan yang cukup kompleks agar bisa tampil secara online di browser.</p>\n<h2>Keuntungan menggunakan headless CMS</h2>\n<p>Penggunaan headless CMS selain mudah dan praktis, namun juga berbiaya rendah atau bahkan gratis. Apabila headless CMS yang anda bangun dari awal terinstalasi dalam salah satu penyedia jasa berbasis cloud computing, biasanya akan memakan biaya yang cukup mahal. </p>\n<p>Sudah dipastikan CMS seperti joomla, wordpress dan sejenisnya membutuhkan tingkat pengaturan yang cukup rumit serta memakan waktu yang tidak sedikit. Sedangkan Headless secara instalasi sangat memudahkan pengguna karena hanya tinggal mengikuti beberapa prosedur yang sudah tersedia. </p>\n<p>Secara skalabilitas, headless CMS mampu secara elastis beradaptasi dengan arsitektur berbasis cloud. Dan untuk bagian keamanan, konten-konten yang dibuat melalui headless CMS kebanyakan menggunakan CDN(Content Delivery Network) sehinnga dapat mengurangi resiko serangan DDOS(denial-of-service-attack).</p>\n<h2>Kesimpulan</h2>\n<p>Sebagaimana penggunaan regular CMS yang pada umumnya memerlukan sebuah database yang dapat menyimpan sebuah konten, lalu sebuah tampilan antar muka untuk admin, dimana didalamannya ada integrasi antara pengaturan untuk menulis sebuah konten dan cara menampilkannya dihalaman depan website. Memastikan juga konektivitas antara sebuah tampilan depan website dengan basis data.</p>\n<p>Berbeda dengan headless CMS, dimana suatu konten dapat dikirim melalui sebuah API(Application Programmable Interface). Karena mengusung sebuah konsep headless maka konten apapun dalam headless CMS mampu digunakan kedalam aplikasi IOS, dan aplikasi Android begitu pula dengan media browser </p>\n<p><a href=\"https://en.wikipedia.org/wiki/Headless_content_management_system\">source 1</a>\n<a href=\"https://headlesscms.org/about\">source 2</a>\n<a href=\"\">source 3</a></p>","frontmatter":{"title":"Headless CMS dan berbagai fungsinya","date":"Invalid date","featuredImage":null}}},"pageContext":{"slug":"/headless-cms/","previous":{"fields":{"slug":"/bahas-tentang-cdn/"},"excerpt":"Apa itu CDN CDN(Content Delivery Network) merupakan jaringan simpul server geografis yang tersebar luas di seluruh dunia. CDN mampu…","frontmatter":{"title":"Bahas tentang CDN (Content Delivery Network)","date":"January 26, 2020","featuredImage":null}},"next":null}}