{"data":{"site":{"siteMetadata":{"title":"Dev Blog","author":"Dika-Dika"}},"markdownRemark":{"id":"1c87cc41-eac8-5616-9d7a-c8489e9bfb15","html":"<h2>Apa itu CDN</h2>\n<p>CDN(Content Delivery Network) merupakan jaringan simpul server geografis yang tersebar luas di seluruh dunia. CDN mampu menyediakan alternatif sumber media yang contohnya kebanyakan adalah seperti statik konten gambar dan berkas JS atau beberapa struktural komponen.</p>\n<p>Dikarenakan rata-rata para pengguna dalam membuka halaman situs kebanyakan konten media digital, maka dari itu dibutuhkanlah suatu jejaringan khusus untuk membangun blok-blok media tersebut kedalam simpul terkecil dan dapat didistribusikan ke seluruh dunia. </p>\n<p>Prosesnya ketika media data digital tersebut dibutuhkan, maka simpul server terdekat ke pengguna akan mengirim statik konten dan memastikan data yang dibutuhkan tidak mengurangi latensi, dengan demikian akan mampu mendapati akses ke halaman situs tersebut lebih cepat.</p>\n<h2>Kapan CDN dibutuhkan</h2>\n<p>Alasan utama mengapa CDN itu dibutuhkan adalah untuk menambah pengalaman pengguna dalam konteks kecapatan membuka halaman sebuah situs. </p>\n<p>Sebuah website memungkinkan ber-hosting di beberapa wilayah negara, akan tetapi kebanyakan akses pengguna berasal dari negara-negara yang berbeda. Sebagai contoh, apabila website anda berhosting di Amerika bagian utara, GTMetrix akan memberikan laporan kepada anda tingkat performa akses website anda berdasarkan lokasi dimana anda berada.</p>\n<p>Untuk para pengguna CDN global dari wilayah eropa memungkinkan untuk dapat mengunduh statik konten mereka dari sumber terdekat. Semisal, apabila pengguna ingin mendapatkan konten digital dari wilayah London, UK,  agar dapat mendapatkan konten yang sama maka tidak perlu sampai mengakses simpul server dari wilayah seberang samudera Atlantis. </p>\n<p>CDN tidak hanya memastikan pengalaman kecepatan untuk si pengguna. Akan tetapi juga mencegah situs tidak crash ketika terjadi lonjakan pengunjung. CDN juga membantu mendistribusikan bandwidth ke beberapa server. Sebagai ganti dari memperbolehkan 1 server untuk menangani banyak trafik.</p>\n<p>Namun CDN tidak selamannya dibutuhkan, dikarenakan CDN merupakan teknologi yang sudah teroptimasi. Kebanyakan CDN itu berbayar atau merupakan layanan pihak ketiga, dan cara mengimplementasikannya itu tergantung dari bagaimana tujuan situs anda, prioritas dan biaya anda.</p>\n<h2>CDN Untuk Konten Gambar</h2>\n<p>Untuk memaksimalkan kecepatan dari sebuah gambar yang disajikan kustomer atau pengguna layanan web adalah merupakan tantangan bisnis dari kebanyakan pengunjung web toko e-commerce. Pada kebanyakan contoh kasus, situs butuh waktu lama untuk melakukan proses pengunduhan gambar. Ini terjadi karena berbagai macam hal termasuk bagaimana perbedaan dalam mengelola media manajemen citra atau reguler CDN</p>\n<h2>Implementasi dan Biaya</h2>\n<p>Ini terkadang dalam pengimplementasikan suatu CDN akan terdengar menyulitkan(tergantung bagaimana sebuah situs dan tingkat kompleksitas-nya). Tetapi untuk website semacam berita atau profil sebuah perusahaan akan mudah dalam pengaplikasiannya. Secara esensi, anda perlu men-set CDN bagian file mana yang dibutuhkan. Setelah itu anda perlu mengkonfigurasi situs anda agar dapat megirim berbagai macam file yang akan ditangani.</p>\n<p>Untuk para pengguna yang pernah menggunakan CMS(wordpress, Drupal, Magento, dll) ada terdapat plugin yang tersedia namun dalam mengkonfigurasikannya terbilang sulit. Dalam tingkat implementasinya mungkin memerlukan perubahan DNS records dan juga perubahan nama server domain anda.</p>\n<h2>Biaya untuk CDN</h2>\n<p>Kebanyakan umumnya CDN adalah layanan pihak ketiga yang berbayar. Layanan tersebut dapat bergantung dari sebuah bandwidth, wilayah dan sekuritas ssl yang diperlukan. Sebagai contoh, apabila pengunjung website anda itu kebanyakan dari benua Amerika atau Eropa, maka anda cukup membeli server CDN yang lokasinya berada di benua Asia. Dan yang anda perlu ketahui adalah harga dari sebuah CDN itu beragam, dan tergantung bagaimana biaya yang anda keluarkan untuk website khususnya pada aset media digital anda.</p>\n<p><a href=\"https://gtmetrix.com/why-use-a-cdn.html\">source 1</a>\n<a href=\"https://www.scientiamobile.com/what-is-an-image-cdn/\">source 2</a>\n<a href=\"https://www.cincopa.com/blog/what-is-image-cdn-and-why-should-you-care/\">source 3</a></p>","frontmatter":{"title":"Bahas tentang CDN (Content Delivery Network)","date":"January 26, 2020","featuredImage":null}}},"pageContext":{"slug":"/bahas-tentang-cdn/","previous":{"fields":{"slug":"/8-aturan-emas-desain-UI/"},"excerpt":"Pada dasarnya Prinsip 8 aturan emas tampilan tatap muka ini berasal dari penyempurnaan serta pengalaman pembuatan desain tatap muka yang…","frontmatter":{"title":"8 Aturan emas dalam desain UI","date":"September 10, 2019","featuredImage":null}},"next":{"fields":{"slug":"/headless-cms/"},"excerpt":"Apa itu headless CMS Sederhananya headless content management system merupakan satu bagian dari cms yang dibangun dari dasar sebagai gudang…","frontmatter":{"title":"Mengenal Headless CMS dan berbagai Fiturnya","date":"February 5, 2020","featuredImage":null}}}}