{"data":{"site":{"siteMetadata":{"title":"Dev Blog","author":"Dika-Dika"}},"markdownRemark":{"id":"ee8167cf-ccc1-50a2-b4eb-9a3c1992831c","html":"<p>Pada dasarnya Prinsip 8 aturan emas tampilan tatap muka ini berasal dari penyempurnaan serta pengalaman pembuatan desain tatap muka yang membutuhkan validasi dan pengaturan yang spesifik pada domain desain. Dan ke-8 aturan emas ini yang dikemukakan oleh Schneiderman adalah sebagai berikut :</p>\n<ul>\n<li>Konsistensi\nKonsistensi dilakukan pada urutan tindakan, perintah, dan istilah yang digunakan pada prompt, menu, serta layar bantuan.</li>\n<li>Memungkinkan pengguna untuk menggunakan shortcut\nAda kebutuhan dari pengguna yang sudah ahli untuk meningkatkan kecepatan interaksi, sehingga diperlukan singkatan, tombol fungsi, perintah tersembunyi, dan fasilitas makro.</li>\n<li>Memberikan umpan balik yang informatif\nUntuk setiap tindakan operator, sebaiknya disertakan suatu sistem umpan balik. Untuk tindakan yang sering dilakukan dan tidak terlalu penting, dapat diberikan umpan balik yang sederhana. Tetapi ketika tindakan merupakan hal yang penting, maka umpan balik sebaiknya lebih substansial. Misalnya muncul suatu suara ketika salah menekan tombol pada waktu input data atau muncul pesan kesalahannya.</li>\n<li>Merancang dialog untuk menghasilkan suatu penutupan\nUrutan tindakan sebaiknya diorganisir dalam suatu kelompok dengan bagian awal, tengah, dan akhir. Umpan balik yang informatif akan meberikan indikasi bahwa cara yang dilakukan sudah benar dan dapat mempersiapkan kelompok tindakan berikutnya.</li>\n<li>Memberikan penanganan kesalahan yang sederhana\nSedapat mungkin sistem dirancang sehingga pengguna tidak dapat melakukan kesalahan fatal. Jika kesalahan terjadi, sistem dapat mendeteksi kesalahan dengan cepat dan memberikan mekanisme yang sedehana dan mudah dipahami untuk penanganan kesalahan.</li>\n<li>Mudah kembali ke tindakan sebelumnya\nHal ini dapat mengurangi kekuatiran pengguna karena pengguna mengetahui kesalahan yang dilakukan dapat dibatalkan; sehingga pengguna tidak takut untuk mengekplorasi pilihan-pilihan lain yang belum biasa digunakan.</li>\n<li>Mendukung tempat pengendali internal (internal locus of control)\nPengguna ingin menjadi pengontrol sistem dan sistem akan merespon tindakan yang dilakukan pengguna daripada pengguna merasa bahwa sistem mengontrol pengguna. Sebaiknya sistem dirancang sedemikan rupa sehingga pengguna menjadi inisiator daripada responden.</li>\n<li>Mengurangi beban ingatan jangka pendek\nKeterbatasan ingatan manusia membutuhkan tampilan yang sederhana atau banyak tampilan halaman yang sebaiknya disatukan, serta diberikan cukup waktu pelatihan untuk kode, mnemonic, dan urutan tindakan.</li>\n</ul>\n<p>sumber: </p>\n<ul>\n<li>[Shneiderman, B., 1998, Designing the User Interface – Strategies for Effective Human-Computer Interaction, Third Edition, Addison-Wesley, USA.]</li>\n<li><a href=\"http://iwanbinanto.com/2008/07/21/8-aturan-emas-desain-user-interface/\">Sumber 1</a></li>\n</ul>","frontmatter":{"title":"8 Aturan emas dalam desain UI","date":"September 10, 2019","featuredImage":null}}},"pageContext":{"slug":"/8-aturan-emas-desain-UI/","previous":{"fields":{"slug":"/Quality-Assurance-di-IT/"},"excerpt":"QA atau Quality assurance secara umum dalam dunia IT merupakan suatu tugas pengujian dalam proses membangun sebuah produk serta menjamin…","frontmatter":{"title":"Quality Assurance di IT","date":"May 5, 2019","featuredImage":null}},"next":{"fields":{"slug":"/bahas-tentang-cdn/"},"excerpt":"Apa itu CDN CDN(Content Delivery Network) merupakan jaringan simpul server geografis yang tersebar luas di seluruh dunia. CDN mampu…","frontmatter":{"title":"Bahas tentang CDN (Content Delivery Network)","date":"January 26, 2020","featuredImage":null}}}}