{"data":{"site":{"siteMetadata":{"title":"Dev Blog","author":"Dika-Dika"}},"markdownRemark":{"id":"55ef84e2-2b48-5dbc-a46d-cd1e0739570c","html":"<p>QA atau Quality assurance secara umum dalam dunia IT merupakan suatu tugas pengujian dalam proses membangun sebuah produk serta menjamin jalannya produk tersebut dapat menghasilkan sistem yang terjamin kualitasnya. Jadi pada dasarnya seorang Quality Assurance mempunyai tanggung jawab terkait dengan peran jaminan kualitas produk yang akan di hasikan. Untuk mengetahui lebih dalam tentang QA, adapun jenisnya yaitu QA Tester dan QA Engineer. Berikut penjelasannya:</p>\n<h2>Tentang QA Tester dan QA Engineer</h2>\n<p>QA tester memiliki tugas utama melakukan pengujian terhadap perangkat, membuat alur pengujian, serta membuat laporan hasil pengujian. Sedangkan, QA Engineer tidak jauh berbeda dengan QA Tester dalam hal kemampuan pengujiannya. Dalam melakukan proses testing seorang QA Engineer harus memiliki kriteria khusus tersendiri. kemampuannya tersebut diantaranya:</p>\n<ul>\n<li>Mindset pengujian\nHarus memiliki pola pikir yang luas mengenai penggunaan suatu sistem dimana pengetesan sistem tersebut dapat terjamin kualitasnya.</li>\n<li>Analisa &#x26; pengujian fungsional\nDapat mampu menganalisa kebutuhan fungsional sistem yang akan dibangun dan memastikan sistem yang sudah dibuat mampu memenuhi kebutuhan yang telah ditentukan.- Perbaikan proses </li>\n<li>Pengujian keamanan\nQA Engineer mampu melakukan pengujian keamanan secara detail sehingga memiliki jaminan keamanan yang tinggi. Contoh pengujian pada proses login dapat dilakukan dengan melakukan pengujian apakah password yang dimasukkan memiliki batas minimal karakter, pengaruh antara kombinasi huruf besar dan kecil pada password, dll.</li>\n<li>pengujian performa\nmampu melakukan pengujian terhadap performa dari sistem. Beberapa contoh pengujian yang dapat dilakukan untuk menguji performa sistem dapat dilakukan dengan melakukan pengujian sistem terhadap respon tertentu apakah sistem akan menerima respon dengan cepat atau tidak. Dengan adanya pengujian performa, maka diharapkan QA Engineer dapat memastikan bahwa sistem yang dihasilkan memiliki performa serta kualitas yang sesuai.</li>\n<li>User Acceptance Testing (UAT)\nSeorang QA Engineer harus mampu menghasilkan dokumen yang dijadikan bukti bahwa sistem yang telah dibuat sudah dapat diterima oleh pengguna apabila hasil pengujian tersebut sudah bisa dianggap memenuhi kebutuhan pengguna. Dari hasil dokumentasi tersebut, maka dapat diambil kesimpulan apakah sistem yang telah diuji dapat diterima atau tidak.</li>\n</ul>\n<p>sumber:\n<a href=\"http://jobsinfopedia.blogspot.com/2015/12/pengertian-tugas-tanggung-jawab-quality.html\">artikel 1</a>\n<a href=\"https://medium.com/skyshidigital/quality-assrurance-dalam-dunia-it-999ee722c736\">artikel 2</a>\n<a href=\"https://medium.com/@makersinstitute/mengenal-lebih-jauh-tentang-software-quality-assurance-844361cd50db\">artikel 3</a></p>","frontmatter":{"title":"Quality Assurance di IT","date":"May 05, 2019","featuredImage":null}}},"pageContext":{"slug":"/Quality-Assurance-di-IT/","previous":{"fields":{"slug":"/mengenal-frontend-framework/"},"excerpt":"Frontend Framework dalam konteks ini adalah merupakan suatu kerangka kerja untuk aplikasi web agar dalam pengembangannya dapat terstruktur…","frontmatter":{"title":"Mengenal Frontend Framework","date":"April 25, 2019","featuredImage":null}},"next":{"fields":{"slug":"/8-aturan-emas-desain-UI/"},"excerpt":"Pada dasarnya Prinsip 8 aturan emas tampilan tatap muka ini berasal dari penyempurnaan serta pengalaman pembuatan desain tatap muka yang…","frontmatter":{"title":"8 Aturan emas dalam desain UI","date":"September 10, 2019","featuredImage":null}}}}