{"data":{"site":{"siteMetadata":{"title":"Dev Blog","author":"Dika-Dika"}},"markdownRemark":{"id":"65273f6e-999c-503b-a5dd-1d60e910055d","html":"<h2>Intro</h2>\n<p>Teknikal dokumentasi di dalam rekayasa perangkat lunak merupakan sebuah proses untuk menulis keseluruhan material yang berhubungan dengan proses pengembangan rekayasa piranti lunak. Mulai dari kebutuhan pengguna sampai desain, pengembangan sampai proses akhir dan rangkuman catatan memerlukan teknikal dokumentasi agar para stakeholder mengetahui bagaimana proses dibalik pengembangan tersebut.</p>\n<p>Singkatnya, dokumentasi teknikal memegang peranan penting dalam mengumpulkan segala informasi yang berkaitan dengan proses pengembangan perangkat lunak dari awal hingga akhir.</p>\n<p>Beberapa tipe-tipe teknikal dokumentasi yang mungkin anda perlu ketahui:</p>\n<ul>\n<li>Dokumentasi untuk programmer</li>\n<li>Dokumentasi untuk non-programmer</li>\n<li>Dokumentasi untuk penggunaan internal teknikal</li>\n<li>Dokumnetasi untuk penggunaan eksternal teknikal</li>\n<li>Dokumentasi sebuah proses</li>\n<li>Dokumentasi untuk produk</li>\n<li>Dokumentasi untuk para pengguna</li>\n<li>Dokumentasi untuk kebutuhan pengguna</li>\n<li>Pengetahuan abstrak</li>\n<li>Detail guideline</li>\n</ul>\n<h2>Tujuan dari teknikal dokumentasi</h2>\n<p>Jadi, tujuan utama dari suatu teknikal dokumentasi adalah sebagai bentuk komunikasi tertulis dari sebuah perusahaan perangkat lunak yang mana penggunaannya untuk memahami lebih dalam mengenai produk yang dibangun. Semisal contohnya seperti: kebutuhan proses, ide pokoknya, teknologi apa yang digunakan, proses pengembangannya, dan testing dari perangkat lunak itu sendiri. Bentuk detail dan kerapihan dari sebuah teknikal dokumentasi memungkinkan menjawab semua setiap pertanyaan penggunanya.</p>\n<p>Berikut beberapa poin penting dari sebuah teknikal dokumentasi.</p>\n<ul>\n<li>Berguna sebagai bahan acuan dari desain serta metoda sebelumnya.</li>\n<li>Informasi penting dari sebuah integrasi modul-modul yang terpisah.</li>\n<li>Membantu dalam efisiensi sebuah kode: inspeksi, testing, korelasi dan perbaikan.</li>\n<li>Memfasilitasi sebuah komunikasi yang efektif, berdasarkan sebuah sistem </li>\n</ul>\n<h2>Bagaimana cara merencanakan, menulis dan merangkum suatu teknikal dokumentasi</h2>\n<p>Hal pertama yang anda butuhkan adalah memutuskan siapa saja yang bertanggungjawab terhadap tugas tersebut. Teknikal dokumentasi biasanya dikerjakan oleh orang yang mengetahui bagaimana proses sebuah pengembangan perangkat lunak ketika dibangun atau seorang penulis teknikal yang sudah terlatih men-translasikan sebuah produk yang rumit. </p>\n<p>Berikut adalah beberapa tujuan khusus membuat perencanaan dokumentasi yang baik: </p>\n<p>Lakukan riset dan skema dari suatu perencanaan dokumentasi\nSetiap penulisan yang berkaitan dengan latar belakang teknikal biasanya diawali dengan riset yang mendalam.<br>\nBerikut ini adalah hal-hal apa saja yang diperlukan dalam teknikal dokumentasi:</p>\n<ul>\n<li>Sederhananya dalam membuat dokumentasi teknikal adalah agar beberapa pengguna mengetahui tujuan penggunaannya dan essensi dari sebuah perangkat lunak itu dibuat.</li>\n<li>Sebagai sumber audit dan pencaharian utama dalam penggunaan perangkat lunak.</li>\n<li>Sebagai kumpulan panduan pranalar dalam menjelaskan fungsi atau sistem dari sebuah perangkat lunak secara mendetail.</li>\n<li>Sebagai alat bantu manajemen dari sebuah perangkat lunak.</li>\n<li>Dan terakhir sebagai laporan akhir dari suatu pengembangan perangkat lunak.</li>\n</ul>\n<p>Berikutnya dalam pembuatan dokumentasi yang perlu diperhatikan adalah gaya penulisannya, hal-hal dibawah ini merupakan aturan sederhana dalam membuat dokumentasi untuk pengembangan perangkat lunak.</p>\n<ul>\n<li>Menulis untuk dapat bisa dibaca. Gunakan bahasa yang cukup baku dan jelas serta dapat dimengerti bagi para pengguna yang baru mulai perangkat lunak tersebut.</li>\n<li>Dokumentasikan hal-hal yang dibutuhkan seperti bagaimana SOP dari perangkat lunak tersebut.</li>\n</ul>\n<p>Langkah selanjutnya adalah mempersiapkan tata aturan pengiriman dari sebuah teknikal dokumentasi. Hal ini dilakukan agar mendapatkan umpan balik dan juga terlihat tampak profesional dalam penggarapan sebuah perangkat lunak yang kompleks.\nPastikan juga untuk melakukan cek pada isu-isu UX(User Experience), Hal ini mencegah untuk para pengguna baru mengetahui langkah-langkah apa saja yang harus dilakukan untuk menggunakan perangkat lunak tersebut.</p>\n<p>Langkah terakhir yaitu membuat jadwal pembaharuan dari sebuah teknikal dokumentasi agar progres dari dokumentasi tersebut dapat diawasi apabila terdapat fitur-fitur terbaru didalamnya.</p>\n<p><a href=\"https://dev.to/codingpixelus/importance-of-technical-documentation-in-software-development-50e5\">source 1</a>\n<a href=\"https://plan.io/blog/technical-documentation/#when-why-and-how-to-properly-use-technical-documentation\">source 2</a></p>","frontmatter":{"title":"Teknikal dokumentasi di dalam pengembangan software","date":"February 28, 2020","featuredImage":null}}},"pageContext":{"slug":"/teknika-dokumentasi/","previous":{"fields":{"slug":"/headless-cms/"},"excerpt":"Apa itu headless CMS Sederhananya headless content management system merupakan satu bagian dari cms yang dibangun dari dasar sebagai gudang…","frontmatter":{"title":"Mengenal Headless CMS dan berbagai Fiturnya","date":"February 5, 2020","featuredImage":null}},"next":null}}